[{"text":"SENIOR FOOD DEFENSE ANALYST Summary Experience as public relations professional, strategist, analyst, and publicist.","entities":[{"text":"SENIOR FOOD DEFENSE ANALYST","type":"Job Title","start_idx":0,"end_idx":27},{"text":"public relations","type":"Skill","start_idx":50,"end_idx":66},{"text":"strategist,","type":"Skill","start_idx":81,"end_idx":92},{"text":"analyst,","type":"Skill","start_idx":93,"end_idx":101},{"text":"publicist.","type":"Skill","start_idx":106,"end_idx":116}]},{"text":"Strong influencing skills to achieve positive outcomes in a wide variety of areas.","entities":[{"text":"Strong influencing","type":"Skill","start_idx":0,"end_idx":18}]},{"text":"Creative and strategic thinker to develop results-driven programs.","entities":[{"text":"Creative","type":"Skill","start_idx":0,"end_idx":8},{"text":"strategic thinker","type":"Skill","start_idx":13,"end_idx":30},{"text":"results-driven","type":"Skill","start_idx":42,"end_idx":56}]},{"text":"Excellent organizational skills and able to adapt to multiple assignments and deadlines in a frequently-changing environment.","entities":[{"text":"organizational","type":"Skill","start_idx":10,"end_idx":24}]},{"text":"Effective ability to develop and maintain extensive network of contacts.","entities":[]},{"text":"Significant experience generating, implementing, and managing strategic programs and promotional outreach.","entities":[{"text":"promotional outreach.","type":"Skill","start_idx":85,"end_idx":106}]},{"text":"Excellent written, verbal, and interpersonal communication skills with strong attention to detail.","entities":[{"text":"written,","type":"Skill","start_idx":10,"end_idx":18},{"text":"verbal,","type":"Skill","start_idx":19,"end_idx":26},{"text":"interpersonal","type":"Skill","start_idx":31,"end_idx":44},{"text":"communication","type":"Skill","start_idx":45,"end_idx":58},{"text":"attention to detail.","type":"Skill","start_idx":78,"end_idx":98}]},{"text":"Capability to work independently and with a variety of partners to achieve goals.","entities":[{"text":"work independently","type":"Skill","start_idx":14,"end_idx":32}]},{"text":"Highlights Extensive experience conducting public relation activities to promote effective communications with the media and stakeholders.","entities":[{"text":"public relation","type":"Skill","start_idx":43,"end_idx":58},{"text":"communications","type":"Skill","start_idx":91,"end_idx":105}]},{"text":"Developed strategic outreach plans for significant programs to include public speaking opportunities, media articles, guidance materials, distribution, talking points, and presentations.","entities":[]},{"text":"Project Manager for numerous initiatives to include assessments conducted on food commodity systems.","entities":[{"text":"Project Manager","type":"Job Title","start_idx":0,"end_idx":15}]},{"text":"Perform oversight and leadership of the process and review of written reports to assure that they meet the operational goals and objectives of the assessment.","entities":[{"text":"leadership","type":"Skill","start_idx":22,"end_idx":32}]},{"text":"Utilize outcomes to develop and execute mitigation strategies and outreach and training initiatives by building a collaborative environment with appropriate stakeholders.","entities":[]},{"text":"Served as USDA Detailee to the Federal Bureau of Investigation Weapons of Mass Destruction Directorate's Infrastructure Countermeasures Unit as a Subject Matter Expert (SME) providing direction, guidance, and technical assistance on food defense issues.","entities":[{"text":"USDA Detailee","type":"Job Title","start_idx":10,"end_idx":23},{"text":"Federal Bureau of Investigation Weapons of Mass Destruction Directorate's Infrastructure Countermeasures Unit","type":"Company Name","start_idx":31,"end_idx":140},{"text":"Subject Matter Expert","type":"Job Title","start_idx":146,"end_idx":167},{"text":"food defense","type":"Skill","start_idx":233,"end_idx":245}]},{"text":"Initiated and implemented mitigation strategies and outreach activities for multiple stakeholders, domestic and international, that benefit both agencies' missions.","entities":[]},{"text":"Accomplishments Serve as the Agency lead on an interagency team designing and conducting a global food defense outreach initiative to promote awareness and implementation of food defense measures by providing technical assistance to foreign governments, academia, and industry.","entities":[{"text":"food defense","type":"Skill","start_idx":98,"end_idx":110}]},{"text":"This initiative has been highly successful in building capacity and sustainability at country and regional levels around the world.","entities":[]},{"text":"In environment of budgetary cuts, initiated and successfully proposed and acquired $230,000 in funding for major international initiative, which had not been accomplished previously.","entities":[]},{"text":"Received a prestigious team award from the Food and Drug Administration for work on this initiative.","entities":[]},{"text":"Experience Senior Food Defense Analyst Dec 2003 to Current Company Name － City , State Serve as Subject Matter Expert and Detailee to the Federal Bureau of Investigation (FBI) for initiation and implementation of outreach activities for supporting countermeasures to prevent intentional contamination of the food supply.","entities":[{"text":"Senior Food Defense Analyst","type":"Job Title","start_idx":11,"end_idx":38},{"text":"Dec 2003 to Current","type":"Date","start_idx":39,"end_idx":58},{"text":"Subject Matter Expert and Detailee","type":"Job Title","start_idx":96,"end_idx":130},{"text":"the Federal Bureau of Investigation","type":"Company Name","start_idx":134,"end_idx":169}]},{"text":"Agency lead on an interagency team responsible for designing and conducting training and outreach to foreign governments, academia, and industry.","entities":[]},{"text":"Acted as communications liaison for internal teams.","entities":[]},{"text":"Successfully initiated integration of the FBI as a partner resulting in law enforcement elements and funding added to initiative.","entities":[]},{"text":"With increased budget constraints by all federal agencies, manage and coordinate the effort to promote international outreach Established long-range objectives and developed innovative strategies to help achieve them to attract additional federal agencies as partners for future support and funding.","entities":[]},{"text":"Developed the strategy, proposal, and supporting materials, to include proposed budgets.","entities":[]},{"text":"A leading expert on policies and strategies to address global supply chain vulnerabilities.","entities":[]},{"text":"Influenced senior leadership resulting in significant funding for major international initiative Established long-range objectives and developed innovative strategies to help achieve them..","entities":[]},{"text":"Routinely conduct senior level briefings to intelligence and law enforcement, foreign, academic, and industry officials; and congressional staff.","entities":[]},{"text":"Managed the editorial content, design and distribution of the external agency newsletter.","entities":[]},{"text":"Cultivated positive relationships with stakeholders through public relations campaigns.","entities":[]},{"text":"Develop outreach materials for various audiences, training, public speaking engagements, media coverage, and distribution mechanisms.","entities":[{"text":"training,","type":"Skill","start_idx":50,"end_idx":59},{"text":"public speaking","type":"Skill","start_idx":60,"end_idx":75}]},{"text":"Research and author reports, articles, issue papers, and talking points for senior officials, and respond to congressional and White House inquiries.","entities":[{"text":"Research","type":"Skill","start_idx":0,"end_idx":8},{"text":"author reports,","type":"Skill","start_idx":13,"end_idx":28}]},{"text":"Demonstrate advanced interpersonal skills by leading intra- and interagency work groups to build partnerships to develop, coordinate, and implement initiatives.","entities":[{"text":"interpersonal skills","type":"Skill","start_idx":21,"end_idx":41}]},{"text":"Analyze information from a variety of sources to advise senior agency leadership on short-term and long-range strategic planning and policy development.","entities":[{"text":"Analyze information","type":"Skill","start_idx":0,"end_idx":19},{"text":"strategic planning","type":"Skill","start_idx":110,"end_idx":128},{"text":"policy development.","type":"Skill","start_idx":133,"end_idx":152}]},{"text":"Serve as liaison to the intelligence and law enforcement communities, which have strengthened communication and coordination programs.","entities":[]},{"text":"Project Manager on activities to develop and execute strategies, outreach, and training initiatives.","entities":[{"text":"Project Manager","type":"Job Title","start_idx":0,"end_idx":15}]},{"text":"Created information sharing agreements with international partners to facilitate the mutual exchange of classified information and coordination of activities to leverage resources.","entities":[]},{"text":"Developed communications strategies and programs, including project time lines.","entities":[]},{"text":"Conferred with production, graphic design and web-design personnel to coordinate production of communications materials.","entities":[]},{"text":"Public Affairs Specialist Jan 2000 to Nov 2003 Company Name － City , State Conducted public relation activities to promote effective communications with the media and constituent groups.","entities":[{"text":"Public Affairs Specialist","type":"Job Title","start_idx":0,"end_idx":25},{"text":"Jan 2000 to Nov 2003","type":"Date","start_idx":26,"end_idx":46}]},{"text":"Marianne L. Elbertson Page 2 Managed preparation and publication of weekly newsletter.","entities":[]},{"text":"Served as Agency lead representative to develop emergency communication protocols with the USDA Office of Communications that is used by all agencies within the Department for communicating with the media in the event of a significant incident.","entities":[]},{"text":"Coordinated and supported agency communication activities and constituent outreach campaigns.","entities":[]},{"text":"Effectively responded to constituent and media inquiries.","entities":[]},{"text":"Established and maintained effective working relationships with all involved stakeholders.","entities":[]},{"text":"Supported various needs of organization to include speech writing, press releases, talking points, presentations, and responses to congressional inquiries.","entities":[]},{"text":"Government Relations Associate Jan 1995 to Dec 1999 Company Name － City , State Assisted Director and Manager of Regulatory Affairs in promoting and advancing company's interests in federal government issues.","entities":[{"text":"Government Relations Associate","type":"Job Title","start_idx":0,"end_idx":30},{"text":"Jan 1995 to Dec 1999","type":"Date","start_idx":31,"end_idx":51}]},{"text":"Worked with appropriate government officials to influence legislation and regulations for company's desired outcomes.","entities":[]},{"text":"Conducted analysis of potential legislation and regulations, and coordination of research projects to support company goals.","entities":[]},{"text":"Public Affairs Specialist Jan 1990 to Apr 1994 Company Name － City , State Effectively responded to media inquiries.","entities":[{"text":"Public Affairs Specialist","type":"Job Title","start_idx":0,"end_idx":25},{"text":"Jan 1990 to Apr 1994","type":"Date","start_idx":26,"end_idx":46}]},{"text":"Researched and wrote complex talking points, issue papers, news releases, fact sheets, and reports.","entities":[]},{"text":"Routinely interacted with member-company executives and representatives in support of organization mission and goals.","entities":[]},{"text":"Assistant Publicist Aug 1987 to Mar 1989 Company Name － City , State Researched and pitched story ideas and tour publicity for a variety of clients.","entities":[{"text":"Assistant Publicist","type":"Job Title","start_idx":0,"end_idx":19},{"text":"Aug 1987 to Mar 1989","type":"Date","start_idx":20,"end_idx":40}]},{"text":"Worked with management to identify trends and developments that might influence public relation decisions and strategies.","entities":[]},{"text":"Drafted media relations materials to include pitch letters, press releases, media alerts, profiles, and press kit materials.","entities":[]},{"text":"Interacted with clients regularly to refine strategic media plans.","entities":[]},{"text":"Organized and oversaw photo shoots, public appearances, promo shoots, features on television profile shows, and talk show appearances.","entities":[]},{"text":"Used knowledge of clients' media goals to identify appropriate media forum.","entities":[]},{"text":"Established and maintained cooperative relationships with various regional and national print and broadcast media to support desired coverage.","entities":[]},{"text":"Administrative Assistant Jul 1986 to Aug 1987 Company Name － City , State Prepared documents for purchasers of packages of syndicated television shows owned by Universal.","entities":[{"text":"Administrative Assistant","type":"Job Title","start_idx":0,"end_idx":24},{"text":"Jul 1986 to Aug 1987","type":"Date","start_idx":25,"end_idx":45},{"text":"Universal.","type":"Company Name","start_idx":160,"end_idx":170}]},{"text":"Completed assignments on-time with high accuracy rate.","entities":[]},{"text":"Education Graduate Certificate , Washington Representatives Program 1994 George Washington University － City , State Bachelor of Arts , Radio/Television/Film Production 1986 University of Maryland － City , State Interests Member of the Daughters of the American Revolution Member of the Colonial Dames 17th Century Society Former President of the Mount Vernon Terrace Community Association Skills Self starter Effective strategic planning Strong leadership skills Excellent relationship building skills Resourceful and persistent Additional Information PROFESSIONAL TRAINING: Detailed list available upon request PROFESSIONAL AWARDS: (Detailed list available upon request) For Leadership and Persistent Effort to Negotiate and Implement a Cooperative Activity Agreement with Canada FDA Group Recognition Award for outstanding Leadership and Contributions toward Increasing Awareness of and Building Global Capacity for Food Defense through Outreach, Education, and Collaboration Exemplary Efforts in Securing a Joint Project Arrangement with the UK Food Standards Agency CIA Outstanding Contribution on Collection Issues of Critical Importance to National Security Developing the Framework for Intelligence Information Sharing for the FSIS Office of Food Defense Initiatives Fostering Collaboration with Intelligence Community including MOUs with CBP and TSA Administrator's Award for Excellence: Work on food security intelligence and communication initiatives","entities":[{"text":"1994","type":"Graduation Year","start_idx":68,"end_idx":72},{"text":"George Washington University","type":"College","start_idx":73,"end_idx":101},{"text":"Bachelor of Arts , Radio/Television/Film Production","type":"Degree","start_idx":117,"end_idx":168},{"text":"1986","type":"Graduation Year","start_idx":169,"end_idx":173},{"text":"University of Maryland","type":"College","start_idx":174,"end_idx":196},{"text":"Self starter","type":"Skill","start_idx":397,"end_idx":409},{"text":"Effective strategic planning","type":"Skill","start_idx":410,"end_idx":438},{"text":"Strong leadership skills","type":"Skill","start_idx":439,"end_idx":463},{"text":"Excellent relationship building skills","type":"Skill","start_idx":464,"end_idx":502},{"text":"Resourceful and persistent","type":"Skill","start_idx":503,"end_idx":529}]}]
